### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-16T21:37:15.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:30",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:26" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:26/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip" -> "lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip"
!       s3_object_version              = "Nb8lYcCr0nBG.hCFGIjIAx5hvbWre_cw" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "26" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "26" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "90b7bf8d200619eed144307a7abd44d9" -> (known after apply)
!       id                     = "lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip" -> (known after apply)
!       key                    = "lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip" -> "lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip" -> "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "Nb8lYcCr0nBG.hCFGIjIAx5hvbWre_cw" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!src/.*",
                        ],
                    ],
+                   [
+                       "zip",
+                       "./src",
+                       null,
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "8654900274482905859" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip" -> "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip"
!           "timestamp" = "1692221758536097000" -> "1692224207381387000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "8477576133743265764" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip" -> "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
-                       prefix_in_zip = "vendor"
                        # (2 unchanged attributes hidden)
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:30" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-16T21:36:59.197+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:30" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/6636c7434f2f6c62b0d4256a35616050ea234c38b72be8968e1f629c910c21b9.zip" -> "builds/4152703447bf3c96bf4cbd753ed4d705017dfe9d8dbc9c2f4e4a23e4a4e1e1b8.zip"
!       s3_object_version           = "bJ15yDnVHg90uokpdtyup5aUrtYAzQpu" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "M4iXXaW/YBUeuUP+J/EHIlALRpKqypvU6YVuGqj5864=" -> (known after apply)
!       source_code_size            = 29718287 -> (known after apply)
!       version                     = "30" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "8a80762a983252ca6e995cace2e5c57e-6" -> (known after apply)
!       id                     = "builds/6636c7434f2f6c62b0d4256a35616050ea234c38b72be8968e1f629c910c21b9.zip" -> (known after apply)
!       key                    = "builds/6636c7434f2f6c62b0d4256a35616050ea234c38b72be8968e1f629c910c21b9.zip" -> "builds/4152703447bf3c96bf4cbd753ed4d705017dfe9d8dbc9c2f4e4a23e4a4e1e1b8.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/6636c7434f2f6c62b0d4256a35616050ea234c38b72be8968e1f629c910c21b9.zip" -> "builds/4152703447bf3c96bf4cbd753ed4d705017dfe9d8dbc9c2f4e4a23e4a4e1e1b8.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "bJ15yDnVHg90uokpdtyup5aUrtYAzQpu" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/4152703447bf3c96bf4cbd753ed4d705017dfe9d8dbc9c2f4e4a23e4a4e1e1b8.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/4152703447bf3c96bf4cbd753ed4d705017dfe9d8dbc9c2f4e4a23e4a4e1e1b8.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2010222711067230531" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/6636c7434f2f6c62b0d4256a35616050ea234c38b72be8968e1f629c910c21b9.zip" -> "builds/4152703447bf3c96bf4cbd753ed4d705017dfe9d8dbc9c2f4e4a23e4a4e1e1b8.zip"
!           "timestamp" = "1692221760141100800" -> "1692224209291879000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "7596135668140791341" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/6636c7434f2f6c62b0d4256a35616050ea234c38b72be8968e1f629c910c21b9.zip" -> "builds/4152703447bf3c96bf4cbd753ed4d705017dfe9d8dbc9c2f4e4a23e4a4e1e1b8.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>